import wechatsogou

import json
import time
ws_api = wechatsogou.WechatSogouAPI()
weixin=[
    '爱健身',
    '健身迷',
    '丁香健身之路',
    '虎扑健身',
    '健身头条',
    'hi运动健身',
    '威尔仕健身',
    '女士健身时尚',
    '大王风游泳健身',

    '韦德伍斯健身平台',
    '多德士健身学社',
    '肌肉网',
    '西湖之声'
]


weixin1=[
    '囚徒健身',
    '牛男',
    '健身中国',
    '健身微课堂',
    '全球健身中心',
    '搏击防身术',
    '一兆韦德健身',
    '寰球健身指南',
    '硬派健身',
    '肌肉男训练营',
    '一起健身',
    '大风哥',
    '男人健身频道',
    '肌肉构成',
    '河马健身会',
    '肌肉志',
    '腹肌撕裂者l',
    '健身白小白',
    '格斗客',
    '健身去吧',
    '淡蓝社区']

weixin2= [  '浩沙健身南大区',
    '健身头条',
    '肌肉梦',
    'Fitness大叔',
    '威猛士健身',
    '运动健身gif图',
    'FitMen六六',
    '肌肉健身君',
    '庆华健身',
    '健身去吧',
    '瘦瘦',
    '我们爱瑜伽',
    '健身卡路里',
    'vv健身',
    '创意果子',
    '每日一健',
    '悦读',
    '黑码资讯',
    '律健健身',
    '美菲尔健身',
    '健身联播',
    '湛江市新阳光体育有限公司',
    '天天练舞',
    '优美双人舞教程',
    '每晚听怀旧金曲',
    '美妙怀旧老歌汇',
    '迈唯健身运动CLUB',
    'MJ铭将健身']

weixin3=[   '三角洲国际健身xyd',
    '悦动时空健身俱乐部',
    '超航健身',
    '动益健身',
    '田东县恺美健身俱乐部',
    '莱斯国际健身俱乐部',
    '天津市南开区排球协会',
    '迈唯健身运动CLUB',
    '雷克健身',
    '宣化熠之佳健身中心',
    '健身肌肉营',
    '金职派']
weixin5=[ '健身之星',
    '十一人',
    '足球之路',
    '随波逐流流',
    '悲观厌世',
    '天下篮球',
    '足篮彩汇'
]
weixin4= [   '篮彩推荐师',
    '准者篮球训练营',
    '柚子篮球',
    '温岭市篮球协会',
    '篮球实用技巧论坛',
    '中国篮球',
    '时装男士',
    '沈阳足球网',
    '青岛足协',
    '爱体育',
    '大业体育',
    '进钧足球',
    '芝华安方'
]
weixin6=[
    '体育BANK',
    '网易体育',
    '捷足体育',
    '财经播报',
    '跑步心情',
    '跑步指南',
    '跑步学院',

]
weixin7=[
    '孙英杰长跑俱乐部',
    '一只学霸',
    '好大夫在线',
    '养身参考',
    '减肥达人训练营',
    '环境养生',
    '慧跑',
    '百姓之声'
]
weixin8=[
    '游泳',
    '游泳爱好者',
    '快乐游泳',
    '快乐游泳',
    '有马体育',
    '陈柏龄的酱油台',
    '体育俱乐部',
    '田径大本营',
    '田径缘',
    '塘沽田径基地',




]
weixin9=[
    '上海交通大学学生体育总会',
    '扬州大学体育学院',
    '陕西省田径协会',
    '广日体育',
    '乒乓世界',
    '袁义兴乒乓',
    '国球荟',
    '启东乒乓球协会',
    '乒乓网',
    '实战乒乓',
    '愉悦好动',
    '徐州市乒乓球运动协会',
    '寸金乒协']
weixin10=[
    '北京体育广播',
    '乒乓球教学视频',
    '杀神体育圈',
    '爱乒客乒乓球',
    '上海纵横飞速乒乓球俱乐部',
    '羽毛球',
    '先锋乒羽',
    '打羽毛球',
    '网球之家',
    '好动网球',
    '网球之家',
    '体育观察'








]
for s in rang[0:1000]
for x in weixin1:
    qq=ws_api.get_gzh_info(str(x))
    qw=ws_api.get_gzh_article_by_history(str(x))
    print(qq)
    print(qw)
    with open(s+'.json', 'w') as f:
        kj=str(qw)
        f.write(kj)



    



